{
  "2_title": "Earth2",
  "2_description": "Software engineering project",
  "2_date": "March 2020 - present",
  "2_body": "Crowdsource, brainstorm, and develop engineering ideas with other engineers and researchers to help address the COVID-19 pandemic and future challenge in United States and world-wide. \n Provide engineering solutions to impacted research labs under this pandemic, in accordances to initiatives provided by NAE, NIH, BARDA's stockpile authority, etc. For more information, please go to the official UCSD website.",

  "3_title": "CORE platform",
  "3_description": "Research project",
  "3_date": "March 2020 - present",
  "3_body": "Student researcher at UCSD ReCODE Health. The Connected and Open Research Ethics (CORE) Platform lies under ReCODE Health where researchers can share your expertise or ask questions about Mobile Imaging, Pervasive Sensing, Social Media and Location Tracking (MISST) use in research. Indepedently migrated the backend of CORE platform from Ruby on Rails (RoR) to NodeJS in 3 days with 30+ commits and 10k+ code.\nParticipate in other statistical-based machine learning research, Human-Computer Interaction (HCI)",


  "4_title": "UC3D",
  "4_description": "A Platform that Provides Custom Solutions for Educational Institutions.",
  "4_date": "July 2019 - June 2020",
  "4_body": "An education platform that aims to enhance the comprehension rate and bandwidth rate of students using visualization. We have connected with different clients, such as beauty school and other e-commerce sites owners, to provide custom solutions to build online learning platforms for their users. Meanwhile, we are developing templates that are specifically for education use only. This quarter (Winter 2019), we are carrying out pilot studies in the Economics and Biology departments of UCSD to test out the MVP.",


  "5_title": "Hair Loss Research",
  "5_description": "A research team of six people",
  "5_date": "July 2019 - June 2020",
  "5_body": "Developing an iOS App for the on-going hair loss research, with the help of HealthKit and ResearchKit. Researching on a machine learning solution for the model built on complex networks that has a plethora of variables.",

  "6_title": "Bebin",
  "6_description": "A Research Management Platform.",
  "6_date": "December 2019 - June 2020",
  "6_body": "A research management platform that is integrated with multiple resources, such as Publish or Perish and Hypothesis, aiming to boost the efficiency within a research team. Support research papers injection directly from data exported from Publish or Perish, and provide convenient interface to assign papers, view annotations on Hypothesis, and perform peer review.\nThe front end is prototyped using Webflow, and the back end is using Node, a hybrid of Express and Apollo, and MongoDB.",

  "7_title": "Food Court, a Community-based Delivery App",
  "7_description": "TritonByte Team",
  "7_date": "May 2019 - Present",
  "7_body": "Food Court is a community-based food delivery app that aims to provide well-prepared and affordable food for college students. We have connected with local restaurants for the service similar to food catering, but have fixed delivery locations, more diversity food options, and increased order quantities. \nBesides the mobile app, we are also developing a mobile app for drivers and a web platform for restaurants for better management. The front ends are implemented using React-Native and React, while the backend is using Node, Apollo, and GraphQL.",

  "8_title": "PersonalBest",
  "8_description": "Android App CSE110 Software engineering class course project",
  "8_date": "Winter 2018",
  "8_body": "PersonalBest is a fitness app that uses Google Fit and Google + APIs to let users set their step goals, record active walks, add and chat with friends, and share their fitness statistics. Enabled live chat and push notifications as users approach their step goals using Firebase Cloud Messaging.",


  "9_title": "MyTritonLink, iOS App",
  "9_description": "TritonByte Team",
  "9_date": "Winter 2018",
  "9_body": "MyTritonLink lets UCSD students easily access their schedules and course enrollment information on mobile devices.\nAchieved 1000+ student downloads.\nIt is currently being integrated into UCSD's official app, Campus Mobile.",


  "10_title": "International Students Short Leasing Platform",
  "10_description": "Project in Chinese Students and Scholars association.",
  "10_date": "October 2017 - October 2018",
  "10_body": "Developed a short leasing platform for international students during quarter breaks. Implemented the MVP using React, NodeJS, and MongoDB."
}
